import 'package:overkeys/models/keyboard_layouts.dart';

const russian = KeyboardLayout(name: 'Russian', keys: [
  ["", "", "", "", "", "", "", "", "", "", "", "", ""],
  ["й", "ц", "у", "к", "е", "н", "г", "ш", "щ", "з", "х", "ъ"],
  ["ф", "ы", "в", "а", "п", "р", "о", "л", "д", "ж", "э"],
  ["я", "ч", "с", "м", "и", "т", "ь", "б", "ю", "ё"],
  [" "]
]);

const arabic = KeyboardLayout(name: "Arabic", keys: [
  ["١", "٢", "٣", "٤", "٥", "٦", "٧", "٨", "٩", "٠", "", "", ""],
  ["ض", "ص", "ث", "ق", "ف", "غ", "ع", "ه", "خ", "ح", "ج", "د"],
  ["ش", "س", "ي", "ب", "ل", "ا", "ت", "ن", "م", "ك", "ط"],
  ["ئ", "ء", "ؤ", "ر", "لا", "ى", "ة", "و", "ز", "ظ"],
  [" "]
]);

const greek = KeyboardLayout(name: 'Greek', keys: [
  ["", "", "", "", "", "", "", "", "", "", "", "", ""],
  [";", "ς", "ε", "ρ", "τ", "υ", "θ", "ι", "ο", "π", "[", "]"],
  ["α", "σ", "δ", "φ", "γ", "η", "ξ", "κ", "λ", "", "'"],
  ["ζ", "χ", "ψ", "ω", "β", "ν", "μ", ",", ".", "/"],
  [" "]
]);

final List<KeyboardLayout> availableVirtualLayouts = [russian, arabic, greek];
